## Wed, July 6th 2022

1. Create conda environment
2. Upload dataset into Postgres Database by using Python
3. Query from Jupyter Lab

### Create a connection to Postgres Database

In [1]:
from sqlalchemy import create_engine
import psycopg2
import pandas as pd

# create connection to psql
db_connection = create_engine("postgresql://postgres:abem1593574628@localhost:5432/practice_dataset")
display(db_connection.connect())

# query function
def query_result(query, con=db_connection):
    return pd.read_sql(query, con=con)

### Upload a csv file to Postgres Database

In [2]:
df = pd.read_csv('iris.csv')
df.sample(5)

     sepal.length  sepal.width  petal.length  petal.width     variety
89            5.5          2.5           4.0          1.3  Versicolor
115           6.4          3.2           5.3          2.3   Virginica
81            5.5          2.4           3.7          1.0  Versicolor
136           6.3          3.4           5.6          2.4   Virginica
76            6.8          2.8           4.8          1.4  Versicolor

In [3]:
df = df.reset_index()
df.columns = ['iris_id', 'sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'variety']
df.sample(5)

     iris_id  sepal_length  sepal_width  petal_length  petal_width     variety
109      109           7.2          3.6           6.1          2.5   Virginica
116      116           6.5          3.0           5.5          1.8   Virginica
105      105           7.6          3.0           6.6          2.1   Virginica
72        72           6.3          2.5           4.9          1.5  Versicolor
60        60           5.0          2.0           3.5          1.0  Versicolor

In [4]:
df.shape

(150, 6)

In [5]:
# initialize the header of table
df.head(n=0).to_sql(
    name='iris', 
    con=db_connection, 
    if_exists='replace', 
    index=False
)

In [6]:
# test if header already added or not
query_result(
"""
SELECT * FROM iris
"""
)

Empty DataFrame
Columns: [iris_id, sepal_length, sepal_width, petal_length, petal_width, variety]
Index: []

In [7]:
# append the rest of dataset
df.to_sql(
    name='iris', 
    con=db_connection, 
    if_exists='append', 
    index=False
)

In [8]:
# test if all data have been added or not
query_result(
"""
SELECT COUNT(*) FROM iris
"""
)

   count
0    150